_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 128)               3211392   
_________________________________________________________________
bn1 (BatchNormalization)     (None, 128)               512       
_________________________________________________________________
fc2 (Dense)                  (None, 128)               16512     
_________________________________________________________________
bn2 (BatchNormalization)     (None, 128)               512       
_________________________________________________________________
predictions (Dense)          (None, 121)               15609     
=================================================================
Total params: 18,059,577
Trainable params: 0
Non-trainable params: 18,059,577
_________________________________________________________________
100%|██████████████████████████████████████| 6097/6097 [00:10<00:00, 566.43it/s]
100%|████████████████████████████████████████| 121/121 [00:00<00:00, 566.23it/s]
y_test: [43], top_preds: [ 43  45  44   2 112], top5: True
top_preds_prob: [(43, 0.98827875), (45, 0.0022214577), (44, 0.0018116568), (2, 0.0011122872), (112, 0.0005336193)]
y_test: [76], top_preds: [76 77 78 30 56], top5: True
top_preds_prob: [(76, 0.9934087), (77, 0.0013056821), (78, 0.0011961974), (30, 0.0008801406), (56, 0.00029825926)]
y_test: [95], top_preds: [ 95  96 119 100  93], top5: True
top_preds_prob: [(95, 0.99646676), (96, 0.00091928424), (119, 0.00027618164), (100, 0.00021418942), (93, 0.00018304192)]
y_test: [84], top_preds: [84 64 83 85 36], top5: True
top_preds_prob: [(84, 0.97352153), (64, 0.005185901), (83, 0.0028238525), (85, 0.0024993084), (36, 0.002005669)]
y_test: [1], top_preds: [  1 112   0   2 113], top5: True
top_preds_prob: [(1, 0.9887734), (112, 0.0016662763), (0, 0.0016498921), (2, 0.000660412), (113, 0.00059863133)]
y_test: [9], top_preds: [  9 102 111  19  10], top5: True
top_preds_prob: [(9, 0.9927003), (102, 0.0008861207), (111, 0.0005595856), (19, 0.00053154444), (10, 0.0005075112)]
y_test: [64], top_preds: [64 66 63 65 82], top5: True
top_preds_prob: [(64, 0.98448414), (66, 0.0051671355), (63, 0.0025289343), (65, 0.0019502703), (82, 0.00056856766)]
y_test: [86], top_preds: [ 86  87 115   8 118], top5: True
top_preds_prob: [(86, 0.9863907), (87, 0.0016000557), (115, 0.0013859331), (8, 0.0006942462), (118, 0.00068635197)]
y_test: [54], top_preds: [54 55 61 56 76], top5: True
top_preds_prob: [(54, 0.9981634), (55, 0.00028092254), (61, 0.00026763842), (56, 0.00015697877), (76, 8.164878e-05)]
y_test: [90], top_preds: [90 89 91 50 66], top5: True
top_preds_prob: [(90, 0.97902143), (89, 0.009808423), (91, 0.00461276), (50, 0.0011374694), (66, 0.00043158376)]
y_test: [60], top_preds: [60 61 58 59 57], top5: True
top_preds_prob: [(60, 0.9686215), (61, 0.009701316), (58, 0.006147785), (59, 0.004210679), (57, 0.0007743312)]
y_test: [73], top_preds: [73 74 72 29 62], top5: True
top_preds_prob: [(73, 0.9845658), (74, 0.008810625), (72, 0.001816431), (29, 0.00057838275), (62, 0.0004455044)]
y_test: [67], top_preds: [67 68 66 91 69], top5: True
top_preds_prob: [(67, 0.9973622), (68, 0.0010660222), (66, 0.00048219346), (91, 0.00013139717), (69, 0.00011384943)]
y_test: [25], top_preds: [25 24 26 96 34], top5: True
top_preds_prob: [(25, 0.9929143), (24, 0.0023197078), (26, 0.0019749291), (96, 0.00026988456), (34, 0.0002675867)]
y_test: [32], top_preds: [ 32  33  31 117  29], top5: True
top_preds_prob: [(32, 0.99044096), (33, 0.0026167533), (31, 0.0011566861), (117, 0.0009991766), (29, 0.0007645892)]
y_test: [62], top_preds: [62 61 63 33 55], top5: True
top_preds_prob: [(62, 0.98462045), (61, 0.010313122), (63, 0.0007621938), (33, 0.0005562912), (55, 0.00039949105)]
y_test: [92], top_preds: [92 91 93  4 87], top5: True
top_preds_prob: [(92, 0.9961951), (91, 0.0006335879), (93, 0.00040647795), (4, 0.0003570292), (87, 0.00015550858)]
y_test: [103], top_preds: [103 102 104 100  13], top5: True
top_preds_prob: [(103, 0.9972372), (102, 0.001550651), (104, 0.00035907744), (100, 5.1273677e-05), (13, 4.3701304e-05)]
y_test: [106], top_preds: [106 105 114 107  91], top5: True
top_preds_prob: [(106, 0.9934642), (105, 0.0012414305), (114, 0.0006275333), (107, 0.00042393603), (91, 0.0004079607)]
y_test: [42], top_preds: [42 44 47 17  6], top5: True
top_preds_prob: [(42, 0.9991565), (44, 0.00019921314), (47, 0.00015482794), (17, 9.5892756e-05), (6, 6.61278e-05)]
y_test: [107], top_preds: [107 106 108  53  28], top5: True
top_preds_prob: [(107, 0.99624497), (106, 0.0008877706), (108, 0.0006674269), (53, 0.0002596493), (28, 0.00023204777)]
y_test: [85], top_preds: [ 85  41  43   5 105], top5: True
top_preds_prob: [(85, 0.9933862), (41, 0.0017357798), (43, 0.0005867991), (5, 0.0005184857), (105, 0.00037534448)]
y_test: [82], top_preds: [82  2 18 51 83], top5: True
top_preds_prob: [(82, 0.97941166), (2, 0.002089002), (18, 0.001971748), (51, 0.0018028124), (83, 0.0016842268)]
y_test: [23], top_preds: [23 24 22 35 32], top5: True
top_preds_prob: [(23, 0.986174), (24, 0.00656434), (22, 0.001366743), (35, 0.0011134492), (32, 0.00037634245)]
y_test: [30], top_preds: [ 30  29  31  32 119], top5: True
top_preds_prob: [(30, 0.983549), (29, 0.0106417155), (31, 0.0014637739), (32, 0.00067212887), (119, 0.0005299444)]
y_test: [27], top_preds: [27 26 29 31 30], top5: True
top_preds_prob: [(27, 0.97993267), (26, 0.009968947), (29, 0.0037153685), (31, 0.0015398144), (30, 0.0011182694)]
y_test: [12], top_preds: [12 19 17 13 10], top5: True
top_preds_prob: [(12, 0.99454224), (19, 0.0006422588), (17, 0.00039478578), (13, 0.00037938543), (10, 0.0003613714)]
y_test: [97], top_preds: [ 97 100 102  29 110], top5: True
top_preds_prob: [(97, 0.9990711), (100, 9.9557474e-05), (102, 8.4031424e-05), (29, 8.030273e-05), (110, 6.95811e-05)]
y_test: [105], top_preds: [105 104   5 114 100], top5: True
top_preds_prob: [(105, 0.9905406), (104, 0.003060653), (5, 0.0008335378), (114, 0.00065080693), (100, 0.00037135405)]
y_test: [48], top_preds: [48 49  7 35 46], top5: True
top_preds_prob: [(48, 0.99799985), (49, 0.00016136395), (7, 0.00015813699), (35, 0.00014502085), (46, 0.00012394655)]
y_test: [63], top_preds: [63 65 64 62 84], top5: True
top_preds_prob: [(63, 0.9797997), (65, 0.003959732), (64, 0.0020845109), (62, 0.0018682531), (84, 0.0009768499)]
y_test: [81], top_preds: [81 80 36 32 16], top5: True
top_preds_prob: [(81, 0.9736353), (80, 0.005005179), (36, 0.00405649), (32, 0.002149721), (16, 0.001939244)]
y_test: [117], top_preds: [117 118  29 116  32], top5: True
top_preds_prob: [(117, 0.97458035), (118, 0.0104781), (29, 0.002807589), (116, 0.0022249299), (32, 0.0011366539)]
y_test: [40], top_preds: [40 41 39 54 12], top5: True
top_preds_prob: [(40, 0.9961797), (41, 0.0005936395), (39, 0.0004999132), (54, 0.00018062082), (12, 0.00015482873)]
y_test: [13], top_preds: [ 13 112 120  24  30], top5: True
top_preds_prob: [(13, 0.992203), (112, 0.0007880529), (120, 0.00063116), (24, 0.0004910266), (30, 0.00027362385)]
y_test: [46], top_preds: [ 46  42 107 109  47], top5: True
top_preds_prob: [(46, 0.9979132), (42, 0.000203751), (107, 0.00015446167), (109, 0.00010458837), (47, 8.685801e-05)]
y_test: [79], top_preds: [ 79 115  24  78  58], top5: True
top_preds_prob: [(79, 0.9934411), (115, 0.0025652808), (24, 0.0004804386), (78, 0.00027763497), (58, 0.00021864385)]
y_test: [56], top_preds: [56 55 57 76 61], top5: True
top_preds_prob: [(56, 0.94192946), (55, 0.041505016), (57, 0.0100809205), (76, 0.0016855835), (61, 0.0005629913)]
y_test: [7], top_preds: [ 7  8 98  2  4], top5: True
top_preds_prob: [(7, 0.99576), (8, 0.0013555415), (98, 0.00046257416), (2, 0.00019881959), (4, 0.00018911508)]
y_test: [69], top_preds: [69 67 68 70 64], top5: True
top_preds_prob: [(69, 0.99873346), (67, 0.00049763813), (68, 0.0003307863), (70, 0.000100843914), (64, 4.0997827e-05)]
y_test: [101], top_preds: [101 100 105  95  98], top5: True
top_preds_prob: [(101, 0.98535556), (100, 0.0059880964), (105, 0.0017563466), (95, 0.00092098233), (98, 0.0007395934)]
y_test: [96], top_preds: [ 96  95  86 100  25], top5: True
top_preds_prob: [(96, 0.9862281), (95, 0.007262786), (86, 0.0008982809), (100, 0.00071292254), (25, 0.00041626758)]
y_test: [51], top_preds: [51 53 17 48 83], top5: True
top_preds_prob: [(51, 0.99052167), (53, 0.0016611425), (17, 0.0010889272), (48, 0.00052042014), (83, 0.0004903958)]
y_test: [19], top_preds: [19 15 16 17 69], top5: True
top_preds_prob: [(19, 0.99317956), (15, 0.0013131654), (16, 0.00073506735), (17, 0.0006400034), (69, 0.0003700717)]
y_test: [14], top_preds: [14 24 84 28 13], top5: True
top_preds_prob: [(14, 0.9855965), (24, 0.002422065), (84, 0.00091938634), (28, 0.00075213227), (13, 0.0007162182)]
y_test: [34], top_preds: [ 34 119  33 117  25], top5: True
top_preds_prob: [(34, 0.9818516), (119, 0.004617927), (33, 0.0023380064), (117, 0.0014286345), (25, 0.0007105281)]
y_test: [5], top_preds: [  5  43   1  71 110], top5: True
top_preds_prob: [(5, 0.9684705), (43, 0.0024431767), (1, 0.0022683337), (71, 0.0018328673), (110, 0.0017190648)]
y_test: [50], top_preds: [ 50  51 112   1  82], top5: True
top_preds_prob: [(50, 0.9901356), (51, 0.0011286597), (112, 0.00043650263), (1, 0.00043314186), (82, 0.00039182845)]
y_test: [74], top_preds: [74 73 21 27 87], top5: True
top_preds_prob: [(74, 0.9950854), (73, 0.0028530736), (21, 0.0001549718), (27, 0.00013741963), (87, 0.00012380458)]
y_test: [100], top_preds: [100  99  64 101  77], top5: True
top_preds_prob: [(100, 0.99204016), (99, 0.0016245439), (64, 0.00082805677), (101, 0.0006199177), (77, 0.00044932135)]
y_test: [6], top_preds: [ 6  2 46 12 15], top5: True
top_preds_prob: [(6, 0.98156655), (2, 0.0026545043), (46, 0.00104448), (12, 0.001013543), (15, 0.0009949337)]
y_test: [91], top_preds: [ 91  92 106  90  87], top5: True
top_preds_prob: [(91, 0.9965919), (92, 0.0019212365), (106, 0.00019020005), (90, 0.00012907044), (87, 0.00011297323)]
y_test: [37], top_preds: [37 36 35 39 11], top5: True
top_preds_prob: [(37, 0.99034286), (36, 0.0010059341), (35, 0.000868082), (39, 0.00081401755), (11, 0.00040237763)]
y_test: [49], top_preds: [49 89 76 91 90], top5: True
top_preds_prob: [(49, 0.9938148), (89, 0.00066263945), (76, 0.0005959625), (91, 0.00043554793), (90, 0.0003978714)]
y_test: [116], top_preds: [116 113  96 118 115], top5: True
top_preds_prob: [(116, 0.9980292), (113, 0.00032948077), (96, 0.0003293846), (118, 0.0001656866), (115, 0.00012867016)]
y_test: [41], top_preds: [41 40 36 14 39], top5: True
top_preds_prob: [(41, 0.9880938), (40, 0.0015087557), (36, 0.0011963708), (14, 0.00085323676), (39, 0.0007958276)]
y_test: [29], top_preds: [ 29  30  31  32 100], top5: True
top_preds_prob: [(29, 0.98389184), (30, 0.006843091), (31, 0.002157139), (32, 0.0009796985), (100, 0.00097421685)]
y_test: [75], top_preds: [75 73  9 98 74], top5: True
top_preds_prob: [(75, 0.9958931), (73, 0.00055183296), (9, 0.00037155717), (98, 0.00023935386), (74, 0.00023155735)]
y_test: [102], top_preds: [102 101 100   9 103], top5: True
top_preds_prob: [(102, 0.99811697), (101, 0.0004212567), (100, 0.00026936797), (9, 0.0001404548), (103, 0.000108018125)]
y_test: [38], top_preds: [38 56 39  0 42], top5: True
top_preds_prob: [(38, 0.9855618), (56, 0.0028858022), (39, 0.0020625994), (0, 0.0012324116), (42, 0.0009761165)]
y_test: [80], top_preds: [80 81 89 16 76], top5: True
top_preds_prob: [(80, 0.9967416), (81, 0.0004512728), (89, 0.00030065217), (16, 0.00029846502), (76, 0.00021732315)]
y_test: [88], top_preds: [88 89 87 71 73], top5: True
top_preds_prob: [(88, 0.9955701), (89, 0.0013772055), (87, 0.0012272318), (71, 0.00033688723), (73, 0.00011443804)]
y_test: [45], top_preds: [45 80 42 43 41], top5: True
top_preds_prob: [(45, 0.97465545), (80, 0.0037746197), (42, 0.003433613), (43, 0.0016814055), (41, 0.0013358562)]
y_test: [3], top_preds: [  3   4   2  57 115], top5: True
top_preds_prob: [(3, 0.9915336), (4, 0.0021150787), (2, 0.0010345464), (57, 0.00067638146), (115, 0.0003647618)]
y_test: [113], top_preds: [113 116 115  62  16], top5: True
top_preds_prob: [(113, 0.9732938), (116, 0.004102451), (115, 0.001980788), (62, 0.0015436149), (16, 0.0015343245)]
y_test: [0], top_preds: [  0  43   1 101  91], top5: True
top_preds_prob: [(0, 0.9912129), (43, 0.001398678), (1, 0.0013643047), (101, 0.00076577126), (91, 0.00075340533)]
y_test: [17], top_preds: [17 47 42 33 19], top5: True
top_preds_prob: [(17, 0.99643964), (47, 0.00045383786), (42, 0.00030594715), (33, 0.00020471697), (19, 0.00018574532)]
y_test: [52], top_preds: [ 52  51  88  53 109], top5: True
top_preds_prob: [(52, 0.98811674), (51, 0.00090950826), (88, 0.0008421248), (53, 0.00073635747), (109, 0.0005402721)]
y_test: [15], top_preds: [15 45 42 11  4], top5: True
top_preds_prob: [(15, 0.9950185), (45, 0.0005384657), (42, 0.0003862171), (11, 0.00021058113), (4, 0.00019813361)]
y_test: [111], top_preds: [111 110 112 114  20], top5: True
top_preds_prob: [(111, 0.99713635), (110, 0.00056995964), (112, 0.0004273126), (114, 0.00018852702), (20, 0.00012114385)]
y_test: [94], top_preds: [94 45 53 80 76], top5: True
top_preds_prob: [(94, 0.9977342), (45, 0.0004171835), (53, 0.00024795794), (80, 0.0002144003), (76, 0.00014866621)]
y_test: [16], top_preds: [16 95 81 69 80], top5: True
top_preds_prob: [(16, 0.99484104), (95, 0.0004902989), (81, 0.00028046986), (69, 0.00023369324), (80, 0.00018663393)]
y_test: [99], top_preds: [ 99 100  98  96 101], top5: True
top_preds_prob: [(99, 0.9895929), (100, 0.0026067998), (98, 0.0020350665), (96, 0.00061034056), (101, 0.0005124624)]
y_test: [8], top_preds: [  8   7 104   1  71], top5: True
top_preds_prob: [(8, 0.99549), (7, 0.00043762263), (104, 0.00032005188), (1, 0.00024425643), (71, 0.00021160253)]
y_test: [2], top_preds: [2 3 1 6 7], top5: True
top_preds_prob: [(2, 0.9927402), (3, 0.0023397896), (1, 0.00056774047), (6, 0.00044962732), (7, 0.0004455687)]
y_test: [35], top_preds: [35 37 22 12 19], top5: True
top_preds_prob: [(35, 0.996503), (37, 0.0004182187), (22, 0.00030749766), (12, 0.0003002705), (19, 0.00027991438)]
y_test: [55], top_preds: [55 56 76 62 27], top5: True
top_preds_prob: [(55, 0.98686963), (56, 0.003591475), (76, 0.0034563723), (62, 0.00159033), (27, 0.00061165396)]
y_test: [39], top_preds: [39 40 38 13 12], top5: True
top_preds_prob: [(39, 0.96687394), (40, 0.014590112), (38, 0.008338445), (13, 0.0021429625), (12, 0.00052105385)]
y_test: [10], top_preds: [10  9 14 12 90], top5: True
top_preds_prob: [(10, 0.9958747), (9, 0.00044866334), (14, 0.0004024605), (12, 0.00023700643), (90, 0.0002135982)]
y_test: [24], top_preds: [24 23 25 33 80], top5: True
top_preds_prob: [(24, 0.9978771), (23, 0.0006288476), (25, 0.0004116643), (33, 0.0002346981), (80, 0.00010691985)]
y_test: [70], top_preds: [70 69 71 94  1], top5: True
top_preds_prob: [(70, 0.9905991), (69, 0.0017805758), (71, 0.0007551666), (94, 0.00060968444), (1, 0.00049431046)]
y_test: [89], top_preds: [89 90 88 96 91], top5: True
top_preds_prob: [(89, 0.9949498), (90, 0.0034941463), (88, 0.00013599648), (96, 0.00011705989), (91, 0.00011237009)]
y_test: [98], top_preds: [ 98  99  97 114 104], top5: True
top_preds_prob: [(98, 0.99519277), (99, 0.0020277712), (97, 0.0008919633), (114, 0.00018163472), (104, 0.00016961551)]
y_test: [33], top_preds: [33 34 55 54 32], top5: True
top_preds_prob: [(33, 0.99019897), (34, 0.0025655662), (55, 0.0008434576), (54, 0.0007892585), (32, 0.00072886725)]
y_test: [110], top_preds: [110 109 111  25 102], top5: True
top_preds_prob: [(110, 0.996366), (109, 0.0003429208), (111, 0.00031671327), (25, 0.00029153883), (102, 0.00013325147)]
y_test: [36], top_preds: [36 19 39 63 95], top5: True
top_preds_prob: [(36, 0.9950251), (19, 0.0007828694), (39, 0.00033794294), (63, 0.0003223549), (95, 0.00023476679)]
y_test: [108], top_preds: [108 107 106 104 110], top5: True
top_preds_prob: [(108, 0.99296147), (107, 0.0034886538), (106, 0.0009072403), (104, 0.00019432325), (110, 0.00016958923)]
y_test: [57], top_preds: [57 58 25 56 60], top5: True
top_preds_prob: [(57, 0.9704737), (58, 0.01874371), (25, 0.0029422133), (56, 0.001486254), (60, 0.0011715717)]
y_test: [11], top_preds: [11 14 45 12 31], top5: True
top_preds_prob: [(11, 0.99365485), (14, 0.0011479972), (45, 0.0008393118), (12, 0.00045018276), (31, 0.00036914277)]
y_test: [72], top_preds: [72 71 73 74 32], top5: True
top_preds_prob: [(72, 0.9967384), (71, 0.0011988112), (73, 0.0007245042), (74, 0.00016693657), (32, 0.00014268796)]
y_test: [26], top_preds: [26 27 25 77 30], top5: True
top_preds_prob: [(26, 0.98803616), (27, 0.004211785), (25, 0.0022616768), (77, 0.0020057193), (30, 0.0006221136)]
y_test: [118], top_preds: [118  27  77 115 117], top5: True
top_preds_prob: [(118, 0.9979962), (27, 0.00026780626), (77, 0.00022320721), (115, 0.0002216847), (117, 0.00018822534)]
y_test: [68], top_preds: [68 67 69 72 59], top5: True
top_preds_prob: [(68, 0.9458283), (67, 0.038684726), (69, 0.007933674), (72, 0.0020788226), (59, 0.0011471403)]
y_test: [47], top_preds: [47 48 51 45 42], top5: True
top_preds_prob: [(47, 0.98789203), (48, 0.0031195309), (51, 0.0011107506), (45, 0.00074831117), (42, 0.000696254)]
y_test: [18], top_preds: [ 18  17   3  82 110], top5: True
top_preds_prob: [(18, 0.9879353), (17, 0.0018206382), (3, 0.0017621476), (82, 0.0009700912), (110, 0.00058541365)]
y_test: [93], top_preds: [ 93  92  60   4 100], top5: True
top_preds_prob: [(93, 0.99227977), (92, 0.001098773), (60, 0.0008660944), (4, 0.00037411368), (100, 0.00029609902)]
y_test: [44], top_preds: [44 42 43 45 30], top5: True
top_preds_prob: [(44, 0.98911184), (42, 0.0078065144), (43, 0.001042986), (45, 0.00021268614), (30, 0.00013198543)]
y_test: [71], top_preds: [71 70 90 88 43], top5: True
top_preds_prob: [(71, 0.99049777), (70, 0.0022216626), (90, 0.0013100524), (88, 0.0008877308), (43, 0.0004988995)]
y_test: [31], top_preds: [ 31  32  29  33 120], top5: True
top_preds_prob: [(31, 0.9911703), (32, 0.004491803), (29, 0.0013541573), (33, 0.00053569506), (120, 0.00027284946)]
y_test: [120], top_preds: [120 108  60 116  13], top5: True
top_preds_prob: [(120, 0.9839393), (108, 0.001969941), (60, 0.0008849674), (116, 0.00087889103), (13, 0.0006833195)]
y_test: [59], top_preds: [59 58 60 61 77], top5: True
top_preds_prob: [(59, 0.9775326), (58, 0.005402418), (60, 0.0048903883), (61, 0.0008190893), (77, 0.0005823516)]
y_test: [77], top_preds: [77 26 76 33 78], top5: True
top_preds_prob: [(77, 0.97771275), (26, 0.011812274), (76, 0.0018694483), (33, 0.0007078995), (78, 0.0006642776)]
y_test: [104], top_preds: [104 105 103   8  38], top5: True
top_preds_prob: [(104, 0.99624), (105, 0.0010058236), (103, 0.00072300504), (8, 0.0004996675), (38, 0.00019284547)]
y_test: [21], top_preds: [ 21  91  74 106  88], top5: True
top_preds_prob: [(21, 0.99463165), (91, 0.00045758218), (74, 0.00040488978), (106, 0.00031009034), (88, 0.00025369177)]
y_test: [66], top_preds: [ 66  67 106  65  64], top5: True
top_preds_prob: [(66, 0.9798069), (67, 0.013101409), (106, 0.0019316977), (65, 0.0013680967), (64, 0.0008125088)]
y_test: [112], top_preds: [112 111 102   1 110], top5: True
top_preds_prob: [(112, 0.99495894), (111, 0.0016616072), (102, 0.00066363235), (1, 0.00036241597), (110, 0.00035711093)]
y_test: [119], top_preds: [119  30  33 117  36], top5: True
top_preds_prob: [(119, 0.9905826), (30, 0.0018033345), (33, 0.0014711327), (117, 0.00088942196), (36, 0.0004700024)]
y_test: [22], top_preds: [22 23 24 54 35], top5: True
top_preds_prob: [(22, 0.91457856), (23, 0.020257719), (24, 0.010090002), (54, 0.006319827), (35, 0.005794844)]
y_test: [4], top_preds: [ 4 92  1 45 42], top5: True
top_preds_prob: [(4, 0.99678314), (92, 0.00036877985), (1, 0.000264072), (45, 0.00026298754), (42, 0.00016738806)]
y_test: [109], top_preds: [109 111 110  16 112], top5: True
top_preds_prob: [(109, 0.9924852), (111, 0.0016306539), (110, 0.0005655439), (16, 0.00054051925), (112, 0.0005098496)]
y_test: [28], top_preds: [ 28 118  27 117  29], top5: True
top_preds_prob: [(28, 0.9970138), (118, 0.0007195339), (27, 0.00023231634), (117, 0.00017922455), (29, 0.0001592813)]
y_test: [83], top_preds: [83 82 37 84  2], top5: True
top_preds_prob: [(83, 0.99644226), (82, 0.0015252284), (37, 0.00024842386), (84, 0.00022067918), (2, 0.00021371384)]
y_test: [53], top_preds: [ 53   6  37 109  36], top5: True
top_preds_prob: [(53, 0.9946832), (6, 0.0008561892), (37, 0.00049177214), (109, 0.00042526025), (36, 0.00036139123)]
y_test: [87], top_preds: [87 88 86 10 75], top5: True
top_preds_prob: [(87, 0.99717736), (88, 0.0010207755), (86, 0.0002186683), (10, 0.0002002308), (75, 0.00018767442)]
y_test: [114], top_preds: [114   5  97  98 105], top5: True
top_preds_prob: [(114, 0.99188423), (5, 0.00067928154), (97, 0.0005344706), (98, 0.0004221818), (105, 0.0003718468)]
y_test: [65], top_preds: [65 63 64 84 36], top5: True
top_preds_prob: [(65, 0.94384164), (63, 0.04232301), (64, 0.008736037), (84, 0.0009303441), (36, 0.00037610886)]
y_test: [58], top_preds: [58 57 60 55 59], top5: True
top_preds_prob: [(58, 0.99634886), (57, 0.001869472), (60, 0.00036558858), (55, 0.00013987077), (59, 0.000101055855)]
y_test: [115], top_preds: [115  15   3 113  24], top5: True
top_preds_prob: [(115, 0.98962235), (15, 0.0013157774), (3, 0.00080363505), (113, 0.0007821378), (24, 0.0006829011)]
y_test: [20], top_preds: [ 20 102  96  79  95], top5: True
top_preds_prob: [(20, 0.99182045), (102, 0.0012744343), (96, 0.00056569296), (79, 0.00053837086), (95, 0.00039922624)]
y_test: [61], top_preds: [61 60 62 63 40], top5: True
top_preds_prob: [(61, 0.98047787), (60, 0.0034303023), (62, 0.0026133324), (63, 0.0026049975), (40, 0.001795134)]
y_test: [78], top_preds: [ 78  79  77 115  20], top5: True
top_preds_prob: [(78, 0.9828796), (79, 0.005576052), (77, 0.0044226246), (115, 0.0010903379), (20, 0.0006937524)]
Top 1: 1.0, Top 5: 1.0

