_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 128)               3211392   
_________________________________________________________________
bn1 (BatchNormalization)     (None, 128)               512       
_________________________________________________________________
fc2 (Dense)                  (None, 128)               16512     
_________________________________________________________________
bn2 (BatchNormalization)     (None, 128)               512       
_________________________________________________________________
predictions (Dense)          (None, 26)                3354      
=================================================================
Total params: 18,047,322
Trainable params: 0
Non-trainable params: 18,047,322
_________________________________________________________________
100%|██████████████████████████████████████| 1309/1309 [00:02<00:00, 577.72it/s]
100%|██████████████████████████████████████████| 26/26 [00:00<00:00, 409.94it/s]
y_test: [10], top_preds: [10 11 13  2  8], top5: True
top_preds_prob: [(10, 0.88145965), (11, 0.039581813), (13, 0.035985693), (2, 0.017053751), (8, 0.009229041)]
y_test: [5], top_preds: [ 6 21  2  4  5], top5: True
top_preds_prob: [(6, 0.86775154), (21, 0.030951057), (2, 0.028792994), (4, 0.026206108), (5, 0.02046367)]
y_test: [2], top_preds: [2 1 5 0 6], top5: True
top_preds_prob: [(2, 0.288283), (1, 0.16174014), (5, 0.14361022), (0, 0.098508164), (6, 0.06266598)]
y_test: [0], top_preds: [ 0 23  1 22  2], top5: True
top_preds_prob: [(0, 0.9511385), (23, 0.027475242), (1, 0.0062506106), (22, 0.0035414568), (2, 0.0032933566)]
y_test: [3], top_preds: [ 3 10 16  4 12], top5: True
top_preds_prob: [(3, 0.97385365), (10, 0.01439405), (16, 0.001979117), (4, 0.0019172347), (12, 0.0012846098)]
y_test: [22], top_preds: [22 24 14 19 10], top5: True
top_preds_prob: [(22, 0.8718686), (24, 0.10278654), (14, 0.0050911545), (19, 0.0032437602), (10, 0.0020908986)]
y_test: [1], top_preds: [ 1  0  5 13  8], top5: True
top_preds_prob: [(1, 0.9928477), (0, 0.004330827), (5, 0.00070663687), (13, 0.00052194076), (8, 0.00051367393)]
y_test: [12], top_preds: [12 11 10 19  4], top5: True
top_preds_prob: [(12, 0.5790146), (11, 0.41209468), (10, 0.0033640522), (19, 0.0021437816), (4, 0.002038078)]
y_test: [16], top_preds: [16 24 23 17 25], top5: True
top_preds_prob: [(16, 0.99655664), (24, 0.0029926274), (23, 0.00033172074), (17, 2.4786292e-05), (25, 2.375924e-05)]
y_test: [17], top_preds: [17 19 20 22 18], top5: True
top_preds_prob: [(17, 0.9928778), (19, 0.0031396104), (20, 0.0024764498), (22, 0.0006634352), (18, 0.00031757847)]
y_test: [15], top_preds: [15  0 14 13  3], top5: True
top_preds_prob: [(15, 0.98423773), (0, 0.005092094), (14, 0.0025851342), (13, 0.0013094126), (3, 0.0012311334)]
y_test: [11], top_preds: [11  8 10  2  5], top5: True
top_preds_prob: [(11, 0.9947094), (8, 0.0024961368), (10, 0.0017162948), (2, 0.00031318804), (5, 0.00026935895)]
y_test: [8], top_preds: [8 4 6 7 3], top5: True
top_preds_prob: [(8, 0.4560473), (4, 0.37458426), (6, 0.04989207), (7, 0.027669614), (3, 0.023019427)]
y_test: [6], top_preds: [ 6  2 21 18  9], top5: True
top_preds_prob: [(6, 0.86629736), (2, 0.03832304), (21, 0.026583545), (18, 0.011439783), (9, 0.011130062)]
y_test: [9], top_preds: [ 9  2  7 22 16], top5: True
top_preds_prob: [(9, 0.9909663), (2, 0.002520917), (7, 0.0020057654), (22, 0.00083045964), (16, 0.0005535439)]
y_test: [21], top_preds: [21 20  9 17 22], top5: True
top_preds_prob: [(21, 0.8897237), (20, 0.0943922), (9, 0.0037796295), (17, 0.002086363), (22, 0.0018927915)]
y_test: [14], top_preds: [14 15  3 16  7], top5: True
top_preds_prob: [(14, 0.9889714), (15, 0.0024193963), (3, 0.0015560905), (16, 0.0014708848), (7, 0.0014422551)]
y_test: [25], top_preds: [25 23 24  1 14], top5: True
top_preds_prob: [(25, 0.7769145), (23, 0.090538055), (24, 0.046037856), (1, 0.027746938), (14, 0.02360046)]
y_test: [19], top_preds: [19 17 20 18 21], top5: True
top_preds_prob: [(19, 0.42783177), (17, 0.34123585), (20, 0.08165067), (18, 0.079595365), (21, 0.03992234)]
y_test: [7], top_preds: [ 6  8 17 10  2], top5: False
top_preds_prob: [(6, 0.8030662), (8, 0.06834121), (17, 0.04266423), (10, 0.027910236), (2, 0.023269279)]
Unmatched [7] and 6
y_test: [24], top_preds: [24 25 23 22 20], top5: True
top_preds_prob: [(24, 0.49354926), (25, 0.31968465), (23, 0.07954244), (22, 0.04768157), (20, 0.0129961185)]
y_test: [18], top_preds: [18 19 25 11 10], top5: True
top_preds_prob: [(18, 0.7321594), (19, 0.13645764), (25, 0.03917275), (11, 0.026374007), (10, 0.019999681)]
y_test: [20], top_preds: [20 21  9 15 14], top5: True
top_preds_prob: [(20, 0.76526886), (21, 0.22347035), (9, 0.0028759446), (15, 0.0018660574), (14, 0.0011802971)]
y_test: [13], top_preds: [13  3  1  8  4], top5: True
top_preds_prob: [(13, 0.96127176), (3, 0.017592559), (1, 0.010025444), (8, 0.008374894), (4, 0.001229059)]
y_test: [4], top_preds: [ 4  5  6 13  9], top5: True
top_preds_prob: [(4, 0.99231565), (5, 0.004866487), (6, 0.0010322282), (13, 0.0008591458), (9, 0.00026508904)]
y_test: [23], top_preds: [23 15  1 24  0], top5: True
top_preds_prob: [(23, 0.99958795), (15, 0.00021473493), (1, 6.5531254e-05), (24, 3.2305037e-05), (0, 2.4790425e-05)]
Top 1: 0.923076923077, Top 5: 0.961538461538

