_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 512)               12845568  
_________________________________________________________________
bn1 (BatchNormalization)     (None, 512)               2048      
_________________________________________________________________
fc2 (Dense)                  (None, 512)               262656    
_________________________________________________________________
bn2 (BatchNormalization)     (None, 512)               2048      
_________________________________________________________________
predictions (Dense)          (None, 26)                13338     
=================================================================
Total params: 27,940,698
Trainable params: 0
Non-trainable params: 27,940,698
_________________________________________________________________
100%|██████████████████████████████████████| 1309/1309 [00:02<00:00, 577.70it/s]
100%|██████████████████████████████████████████| 26/26 [00:00<00:00, 409.81it/s]
y_test: [10], top_preds: [10  4 11 13  2], top5: True
top_preds_prob: [(10, 0.72040826), (4, 0.17554167), (11, 0.05036426), (13, 0.043020044), (2, 0.0068568387)]
y_test: [5], top_preds: [ 4  6  5 10  9], top5: True
top_preds_prob: [(4, 0.4263094), (6, 0.39812782), (5, 0.11119287), (10, 0.030805245), (9, 0.010298745)]
y_test: [2], top_preds: [ 2  7  1 14  0], top5: True
top_preds_prob: [(2, 0.60673255), (7, 0.15333574), (1, 0.075475894), (14, 0.042931937), (0, 0.025955228)]
y_test: [0], top_preds: [ 0 25 15 22 23], top5: True
top_preds_prob: [(0, 0.94428736), (25, 0.04470143), (15, 0.0046834364), (22, 0.0034693081), (23, 0.0015538034)]
y_test: [3], top_preds: [ 3 10  0 11  6], top5: True
top_preds_prob: [(3, 0.99675745), (10, 0.0009219848), (0, 0.00045481377), (11, 0.0003525282), (6, 0.00032429807)]
y_test: [22], top_preds: [22 14 12 24 21], top5: True
top_preds_prob: [(22, 0.99488175), (14, 0.0032188992), (12, 0.0006350689), (24, 0.000514424), (21, 0.0003418947)]
y_test: [1], top_preds: [ 1  0 14  5 16], top5: True
top_preds_prob: [(1, 0.99880826), (0, 0.0002790234), (14, 0.00021432122), (5, 0.0001383556), (16, 0.000115439565)]
y_test: [12], top_preds: [11 12 10  9 19], top5: True
top_preds_prob: [(11, 0.5834702), (12, 0.4163909), (10, 0.00010206135), (9, 1.7785553e-05), (19, 4.0806945e-06)]
y_test: [16], top_preds: [16 23 22 20 14], top5: True
top_preds_prob: [(16, 0.9995097), (23, 0.00035138425), (22, 9.559515e-05), (20, 2.1569103e-05), (14, 6.055603e-06)]
y_test: [17], top_preds: [17 19 20 16 18], top5: True
top_preds_prob: [(17, 0.99942017), (19, 0.00034499593), (20, 0.00017846297), (16, 2.3797875e-05), (18, 9.93251e-06)]
y_test: [15], top_preds: [15 14 24 25  1], top5: True
top_preds_prob: [(15, 0.9947819), (14, 0.0020338187), (24, 0.0012734627), (25, 0.0010593866), (1, 0.000137521)]
y_test: [11], top_preds: [11 12 10  4 19], top5: True
top_preds_prob: [(11, 0.9924797), (12, 0.0018889516), (10, 0.0017352388), (4, 0.0015446902), (19, 0.0006155752)]
y_test: [8], top_preds: [8 7 9 4 3], top5: True
top_preds_prob: [(8, 0.99231297), (7, 0.00284511), (9, 0.0020333373), (4, 0.00081931194), (3, 0.0006075689)]
y_test: [6], top_preds: [ 6  5  4  7 11], top5: True
top_preds_prob: [(6, 0.9931405), (5, 0.0046261055), (4, 0.0015080954), (7, 0.0005199608), (11, 6.986403e-05)]
y_test: [9], top_preds: [ 9  2  1  4 18], top5: True
top_preds_prob: [(9, 0.9999596), (2, 1.6270535e-05), (1, 7.1871195e-06), (4, 3.9768643e-06), (18, 2.9313435e-06)]
y_test: [21], top_preds: [21 20 12  7  2], top5: True
top_preds_prob: [(21, 0.99142635), (20, 0.0076238313), (12, 0.00026150662), (7, 0.0002154365), (2, 9.7480995e-05)]
y_test: [14], top_preds: [14 15  2 16 24], top5: True
top_preds_prob: [(14, 0.99960333), (15, 0.0003017789), (2, 2.590098e-05), (16, 2.5451607e-05), (24, 6.148274e-06)]
y_test: [25], top_preds: [25 23 16 24 18], top5: True
top_preds_prob: [(25, 0.54919773), (23, 0.2660449), (16, 0.075862244), (24, 0.05600259), (18, 0.026376314)]
y_test: [19], top_preds: [19 17 20  7  9], top5: True
top_preds_prob: [(19, 0.4971269), (17, 0.37355825), (20, 0.11783343), (7, 0.004657008), (9, 0.0037751365)]
y_test: [7], top_preds: [10  6  4  8  2], top5: False
top_preds_prob: [(10, 0.5402032), (6, 0.26378232), (4, 0.09763912), (8, 0.04368039), (2, 0.0329987)]
Unmatched [7] and 10
y_test: [24], top_preds: [24 25 23 22 15], top5: True
top_preds_prob: [(24, 0.99804074), (25, 0.0010099391), (23, 0.0007399816), (22, 0.00013786455), (15, 4.855654e-05)]
y_test: [18], top_preds: [18 19  6 17  5], top5: True
top_preds_prob: [(18, 0.92746097), (19, 0.028992252), (6, 0.014710236), (17, 0.009992744), (5, 0.009532647)]
y_test: [20], top_preds: [21 20 14  2  9], top5: True
top_preds_prob: [(21, 0.83535904), (20, 0.16391082), (14, 0.00023373276), (2, 0.00013512807), (9, 0.0001175095)]
y_test: [13], top_preds: [13  4 10  3 18], top5: True
top_preds_prob: [(13, 0.94091415), (4, 0.024108127), (10, 0.012380279), (3, 0.00774983), (18, 0.0045574415)]
y_test: [4], top_preds: [ 4  5  6 11  3], top5: True
top_preds_prob: [(4, 0.98613644), (5, 0.013037983), (6, 0.0004215439), (11, 0.00023856662), (3, 0.00015314562)]
y_test: [23], top_preds: [23 24 22 15 25], top5: True
top_preds_prob: [(23, 0.999711), (24, 0.00023985842), (22, 3.5980225e-05), (15, 3.218374e-06), (25, 3.073473e-06)]
Top 1: 0.846153846154, Top 5: 0.961538461538

