_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 128)               3211392   
_________________________________________________________________
bn1 (BatchNormalization)     (None, 128)               512       
_________________________________________________________________
fc2 (Dense)                  (None, 128)               16512     
_________________________________________________________________
bn2 (BatchNormalization)     (None, 128)               512       
_________________________________________________________________
predictions (Dense)          (None, 27)                3483      
=================================================================
Total params: 18,047,451
Trainable params: 0
Non-trainable params: 18,047,451
_________________________________________________________________
100%|██████████████████████████████████████| 1359/1359 [00:02<00:00, 550.96it/s]
100%|██████████████████████████████████████████| 27/27 [00:00<00:00, 425.67it/s]
y_test: [11], top_preds: [11 20  8 10 12], top5: True
top_preds_prob: [(11, 0.9989773), (20, 0.00028084824), (8, 0.00013479961), (10, 8.607452e-05), (12, 8.5655825e-05)]
y_test: [18], top_preds: [18 13  6 19 17], top5: True
top_preds_prob: [(18, 0.9979475), (13, 0.00075365265), (6, 0.00051538605), (19, 0.00016853947), (17, 0.00012635633)]
y_test: [10], top_preds: [10  9 13 12 19], top5: True
top_preds_prob: [(10, 0.98603094), (9, 0.0060704863), (13, 0.0021803142), (12, 0.0016990501), (19, 0.0010462895)]
y_test: [8], top_preds: [ 8 20  9  1 16], top5: True
top_preds_prob: [(8, 0.98827577), (20, 0.0026861336), (9, 0.0023160647), (1, 0.0016153131), (16, 0.0011353155)]
y_test: [12], top_preds: [12 13  3 19 21], top5: True
top_preds_prob: [(12, 0.9560909), (13, 0.009493256), (3, 0.008969137), (19, 0.004331601), (21, 0.0031785707)]
y_test: [14], top_preds: [14  5 13  0  9], top5: True
top_preds_prob: [(14, 0.9940017), (5, 0.0017586348), (13, 0.001453579), (0, 0.0013942189), (9, 0.00038408284)]
y_test: [9], top_preds: [ 9 10 19 16  8], top5: True
top_preds_prob: [(9, 0.98457634), (10, 0.004859998), (19, 0.0029873052), (16, 0.001625187), (8, 0.0011470524)]
y_test: [25], top_preds: [25 26 24 19 23], top5: True
top_preds_prob: [(25, 0.9923733), (26, 0.0024421518), (24, 0.001974143), (19, 0.0008814624), (23, 0.00041538343)]
y_test: [2], top_preds: [ 2 17  7 19 16], top5: True
top_preds_prob: [(2, 0.9689406), (17, 0.007672658), (7, 0.0052892594), (19, 0.0029629408), (16, 0.0024409518)]
y_test: [1], top_preds: [ 1 12  7  0 15], top5: True
top_preds_prob: [(1, 0.99056035), (12, 0.0026701202), (7, 0.0012039354), (0, 0.0011341097), (15, 0.00081703067)]
y_test: [22], top_preds: [22 23 26 24  7], top5: True
top_preds_prob: [(22, 0.980803), (23, 0.007877787), (26, 0.0035381864), (24, 0.0021870297), (7, 0.00069351436)]
y_test: [24], top_preds: [24 25 23 26  0], top5: True
top_preds_prob: [(24, 0.99532276), (25, 0.0028332386), (23, 0.00058524474), (26, 0.0005301163), (0, 0.00018808938)]
y_test: [5], top_preds: [ 5  6 11  7  1], top5: True
top_preds_prob: [(5, 0.98830545), (6, 0.0027539183), (11, 0.0016293785), (7, 0.0011171649), (1, 0.00075914693)]
y_test: [16], top_preds: [16 21  4 15 20], top5: True
top_preds_prob: [(16, 0.98536843), (21, 0.0026147736), (4, 0.0014190258), (15, 0.0014153927), (20, 0.0013967681)]
y_test: [6], top_preds: [ 6 18 26 16  5], top5: True
top_preds_prob: [(6, 0.99413365), (18, 0.0024416717), (26, 0.000828752), (16, 0.0005018006), (5, 0.00034310823)]
y_test: [20], top_preds: [20 21 24 23  5], top5: True
top_preds_prob: [(20, 0.97237927), (21, 0.005261352), (24, 0.005080291), (23, 0.0034708565), (5, 0.001794884)]
y_test: [23], top_preds: [23 26 15 19 14], top5: True
top_preds_prob: [(23, 0.9842845), (26, 0.0026406776), (15, 0.0020558226), (19, 0.0017242501), (14, 0.0013338847)]
y_test: [4], top_preds: [ 4  3 24  7 16], top5: True
top_preds_prob: [(4, 0.996102), (3, 0.0010418247), (24, 0.0002774589), (7, 0.00024065297), (16, 0.00023685489)]
y_test: [13], top_preds: [13 14  9  5 17], top5: True
top_preds_prob: [(13, 0.99223584), (14, 0.0049589537), (9, 0.00030671046), (5, 0.00024808152), (17, 0.0002460951)]
y_test: [15], top_preds: [15 19  3  2 23], top5: True
top_preds_prob: [(15, 0.98418105), (19, 0.004783537), (3, 0.0012456843), (2, 0.0011521027), (23, 0.0010412486)]
y_test: [3], top_preds: [ 3  2 17  1 23], top5: True
top_preds_prob: [(3, 0.9915946), (2, 0.0012092363), (17, 0.0011980006), (1, 0.0011783935), (23, 0.0008936133)]
y_test: [0], top_preds: [ 0 16  9 25  1], top5: True
top_preds_prob: [(0, 0.98704475), (16, 0.0063994233), (9, 0.00127709), (25, 0.0008319311), (1, 0.0006258222)]
y_test: [21], top_preds: [21  3 20 22 10], top5: True
top_preds_prob: [(21, 0.99859756), (3, 0.00042745238), (20, 0.00021168288), (22, 0.00019457801), (10, 8.028388e-05)]
y_test: [17], top_preds: [17  2  7 18 19], top5: True
top_preds_prob: [(17, 0.9996598), (2, 0.00010548023), (7, 6.1117935e-05), (18, 3.9551425e-05), (19, 3.0103376e-05)]
y_test: [19], top_preds: [19 18 21  2 13], top5: True
top_preds_prob: [(19, 0.9965753), (18, 0.0012306003), (21, 0.0005027533), (2, 0.00034662362), (13, 0.00026287552)]
y_test: [7], top_preds: [ 7  2 16  6  4], top5: True
top_preds_prob: [(7, 0.9949942), (2, 0.0010133808), (16, 0.00086934323), (6, 0.0008252929), (4, 0.0005622223)]
y_test: [26], top_preds: [26 25 24 23 22], top5: True
top_preds_prob: [(26, 0.95402205), (25, 0.029862402), (24, 0.0058699013), (23, 0.0017964098), (22, 0.0013209792)]
Top 1: 1.0, Top 5: 1.0

