_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 64)                1605696   
_________________________________________________________________
bn1 (BatchNormalization)     (None, 64)                256       
_________________________________________________________________
fc2 (Dense)                  (None, 64)                4160      
_________________________________________________________________
bn2 (BatchNormalization)     (None, 64)                256       
_________________________________________________________________
predictions (Dense)          (None, 26)                1690      
=================================================================
Total params: 16,427,098
Trainable params: 0
Non-trainable params: 16,427,098
_________________________________________________________________
100%|██████████████████████████████████████| 1309/1309 [00:02<00:00, 590.66it/s]
100%|██████████████████████████████████████████| 26/26 [00:00<00:00, 411.69it/s]
y_test: [10], top_preds: [10  3  4  8 13], top5: True
top_preds_prob: [(10, 0.45971546), (3, 0.20190126), (4, 0.10772583), (8, 0.073783144), (13, 0.046731498)]
y_test: [5], top_preds: [ 7  4  6 21  5], top5: True
top_preds_prob: [(7, 0.19134064), (4, 0.18137856), (6, 0.16986893), (21, 0.06068742), (5, 0.058625404)]
y_test: [2], top_preds: [ 2  0  1 10  4], top5: True
top_preds_prob: [(2, 0.2984758), (0, 0.24079907), (1, 0.17989951), (10, 0.04264095), (4, 0.029775606)]
y_test: [0], top_preds: [25  0  1 15 10], top5: True
top_preds_prob: [(25, 0.30994532), (0, 0.28465614), (1, 0.07536856), (15, 0.06493414), (10, 0.04988074)]
y_test: [3], top_preds: [ 3 10  2 25  8], top5: True
top_preds_prob: [(3, 0.9881114), (10, 0.0053103575), (2, 0.002760632), (25, 0.000812296), (8, 0.0007060443)]
y_test: [22], top_preds: [22 23 12  9 15], top5: True
top_preds_prob: [(22, 0.37498292), (23, 0.30680937), (12, 0.08338838), (9, 0.06178372), (15, 0.045317657)]
y_test: [1], top_preds: [ 1  6  8  7 14], top5: True
top_preds_prob: [(1, 0.94315404), (6, 0.011668264), (8, 0.009419297), (7, 0.009330367), (14, 0.006144054)]
y_test: [12], top_preds: [ 9 11 12  2 10], top5: True
top_preds_prob: [(9, 0.55883473), (11, 0.23733132), (12, 0.16040954), (2, 0.013253243), (10, 0.0062090256)]
y_test: [16], top_preds: [16 17 20 24 15], top5: True
top_preds_prob: [(16, 0.85517555), (17, 0.08369735), (20, 0.015485996), (24, 0.009780158), (15, 0.00929301)]
y_test: [17], top_preds: [17 20 16 18 21], top5: True
top_preds_prob: [(17, 0.82386476), (20, 0.11477227), (16, 0.018594969), (18, 0.013958734), (21, 0.008616765)]
y_test: [15], top_preds: [15 25  1 22  0], top5: True
top_preds_prob: [(15, 0.9556553), (25, 0.009842032), (1, 0.008697275), (22, 0.00563008), (0, 0.0041058613)]
y_test: [11], top_preds: [11 10  8  2  4], top5: True
top_preds_prob: [(11, 0.60594), (10, 0.16776499), (8, 0.09829565), (2, 0.021456003), (4, 0.020254245)]
y_test: [8], top_preds: [ 4  8 13  9  6], top5: True
top_preds_prob: [(4, 0.30765104), (8, 0.1490645), (13, 0.11777604), (9, 0.103127435), (6, 0.07633525)]
y_test: [6], top_preds: [ 6  7  5 17  8], top5: True
top_preds_prob: [(6, 0.6100533), (7, 0.28615618), (5, 0.030040884), (17, 0.016446814), (8, 0.0093860915)]
y_test: [9], top_preds: [ 9  7  8 11  3], top5: True
top_preds_prob: [(9, 0.65052056), (7, 0.07288323), (8, 0.068024725), (11, 0.035069555), (3, 0.018366173)]
y_test: [21], top_preds: [21 19 20  9 14], top5: True
top_preds_prob: [(21, 0.94805515), (19, 0.008659011), (20, 0.006796347), (9, 0.006256907), (14, 0.005465134)]
y_test: [14], top_preds: [14 18 15 24 16], top5: True
top_preds_prob: [(14, 0.8363776), (18, 0.027634824), (15, 0.021968594), (24, 0.0195922), (16, 0.016012516)]
y_test: [25], top_preds: [23 25 15  1 22], top5: True
top_preds_prob: [(23, 0.35099438), (25, 0.14580183), (15, 0.11079556), (1, 0.09759758), (22, 0.0882786)]
y_test: [19], top_preds: [19 17 20  5 22], top5: True
top_preds_prob: [(19, 0.832151), (17, 0.06490186), (20, 0.0254418), (5, 0.02498521), (22, 0.011795608)]
y_test: [7], top_preds: [ 8  4  6  7 10], top5: True
top_preds_prob: [(8, 0.65461546), (4, 0.109994724), (6, 0.10765763), (7, 0.054108046), (10, 0.01688651)]
y_test: [24], top_preds: [24 25 15 22 23], top5: True
top_preds_prob: [(24, 0.37105998), (25, 0.2947253), (15, 0.112679005), (22, 0.080745466), (23, 0.052787315)]
y_test: [18], top_preds: [18  5 17 13  6], top5: True
top_preds_prob: [(18, 0.5600399), (5, 0.25705475), (17, 0.032964595), (13, 0.027215516), (6, 0.026153658)]
y_test: [20], top_preds: [20 21  9 19 14], top5: True
top_preds_prob: [(20, 0.6493264), (21, 0.23683244), (9, 0.039105657), (19, 0.021945322), (14, 0.012173804)]
y_test: [13], top_preds: [13 10  3  4  8], top5: True
top_preds_prob: [(13, 0.4644014), (10, 0.22215869), (3, 0.14470498), (4, 0.043351498), (8, 0.031226201)]
y_test: [4], top_preds: [ 4  3 10  5 13], top5: True
top_preds_prob: [(4, 0.8224605), (3, 0.06197643), (10, 0.02242445), (5, 0.014149911), (13, 0.012922139)]
y_test: [23], top_preds: [23 22  1 19 14], top5: True
top_preds_prob: [(23, 0.96675), (22, 0.01776255), (1, 0.00374946), (19, 0.0025219948), (14, 0.001884078)]
Top 1: 0.769230769231, Top 5: 1.0

