_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 512)               12845568  
_________________________________________________________________
bn1 (BatchNormalization)     (None, 512)               2048      
_________________________________________________________________
fc2 (Dense)                  (None, 512)               262656    
_________________________________________________________________
bn2 (BatchNormalization)     (None, 512)               2048      
_________________________________________________________________
predictions (Dense)          (None, 26)                13338     
=================================================================
Total params: 27,940,698
Trainable params: 0
Non-trainable params: 27,940,698
_________________________________________________________________
100%|██████████████████████████████████████| 1309/1309 [00:02<00:00, 590.53it/s]
100%|██████████████████████████████████████████| 26/26 [00:00<00:00, 410.35it/s]
y_test: [10], top_preds: [10  4 11  9  5], top5: True
top_preds_prob: [(10, 0.999962), (4, 1.8508375e-05), (11, 8.517339e-06), (9, 3.7548937e-06), (5, 2.7261322e-06)]
y_test: [5], top_preds: [5 4 6 7 3], top5: True
top_preds_prob: [(5, 0.99831843), (4, 0.0010338001), (6, 0.00010906523), (7, 0.00010717891), (3, 7.175601e-05)]
y_test: [2], top_preds: [ 2  1  8  7 13], top5: True
top_preds_prob: [(2, 0.9988098), (1, 0.00031495508), (8, 0.00013758411), (7, 0.00011061595), (13, 8.812397e-05)]
y_test: [0], top_preds: [ 0 24 22  2 25], top5: True
top_preds_prob: [(0, 0.99997735), (24, 3.3067563e-06), (22, 3.283527e-06), (2, 2.6703235e-06), (25, 2.0037294e-06)]
y_test: [3], top_preds: [ 3  4 25 13  9], top5: True
top_preds_prob: [(3, 0.99982125), (4, 9.70721e-05), (25, 2.411042e-05), (13, 9.403083e-06), (9, 7.541818e-06)]
y_test: [22], top_preds: [22 14 25  0 24], top5: True
top_preds_prob: [(22, 0.9981894), (14, 0.00039417602), (25, 0.00033550317), (0, 0.000334837), (24, 0.00022549485)]
y_test: [1], top_preds: [ 1 22 15  6  8], top5: True
top_preds_prob: [(1, 0.9998301), (22, 5.3098953e-05), (15, 4.3185446e-05), (6, 2.7591674e-05), (8, 8.852704e-06)]
y_test: [12], top_preds: [12  9 21 22  2], top5: True
top_preds_prob: [(12, 0.9999989), (9, 9.762424e-07), (21, 5.6908508e-08), (22, 3.154166e-08), (2, 2.5734963e-08)]
y_test: [16], top_preds: [16 25 17 24 21], top5: True
top_preds_prob: [(16, 0.99971014), (25, 7.6689175e-05), (17, 7.563802e-05), (24, 3.188751e-05), (21, 1.7078573e-05)]
y_test: [17], top_preds: [17 16 20 18 14], top5: True
top_preds_prob: [(17, 0.9994916), (16, 0.00031332485), (20, 5.8892496e-05), (18, 4.6244073e-05), (14, 3.9230636e-05)]
y_test: [15], top_preds: [15 14 16 22  3], top5: True
top_preds_prob: [(15, 0.99999106), (14, 2.0711798e-06), (16, 1.6990006e-06), (22, 7.058766e-07), (3, 5.522316e-07)]
y_test: [11], top_preds: [11 10  4  5 18], top5: True
top_preds_prob: [(11, 0.9991105), (10, 0.00068987254), (4, 5.824392e-05), (5, 3.052906e-05), (18, 1.9808389e-05)]
y_test: [8], top_preds: [8 4 9 5 7], top5: True
top_preds_prob: [(8, 0.99869305), (4, 0.00054738054), (9, 0.00024074524), (5, 0.00014571902), (7, 8.011562e-05)]
y_test: [6], top_preds: [6 5 1 7 4], top5: True
top_preds_prob: [(6, 0.99972886), (5, 0.00011129978), (1, 8.822886e-05), (7, 1.9665316e-05), (4, 1.2188182e-05)]
y_test: [9], top_preds: [ 9 20 10 12 24], top5: True
top_preds_prob: [(9, 0.9999248), (20, 2.0471689e-05), (10, 1.6339456e-05), (12, 7.808321e-06), (24, 7.3196697e-06)]
y_test: [21], top_preds: [21 20 12 22 24], top5: True
top_preds_prob: [(21, 0.99999154), (20, 4.735499e-06), (12, 1.0429578e-06), (22, 9.160252e-07), (24, 4.7894576e-07)]
y_test: [14], top_preds: [14  0 16 22  2], top5: True
top_preds_prob: [(14, 0.99961925), (0, 8.06491e-05), (16, 7.647495e-05), (22, 3.6751913e-05), (2, 3.542108e-05)]
y_test: [25], top_preds: [25  3  1 14 12], top5: True
top_preds_prob: [(25, 0.99990344), (3, 2.5299556e-05), (1, 2.4944167e-05), (14, 1.0647159e-05), (12, 6.020288e-06)]
y_test: [19], top_preds: [19 18 17 11 20], top5: True
top_preds_prob: [(19, 0.99978703), (18, 0.0001018673), (17, 3.3883778e-05), (11, 2.1761252e-05), (20, 1.1704505e-05)]
y_test: [7], top_preds: [7 8 6 5 4], top5: True
top_preds_prob: [(7, 0.9991678), (8, 0.00029776996), (6, 0.00026145173), (5, 8.1032435e-05), (4, 5.3221695e-05)]
y_test: [24], top_preds: [24 25 22 23 16], top5: True
top_preds_prob: [(24, 0.9999238), (25, 4.5800887e-05), (22, 8.761851e-06), (23, 7.054062e-06), (16, 6.334139e-06)]
y_test: [18], top_preds: [18 19 17  4 24], top5: True
top_preds_prob: [(18, 0.99980325), (19, 0.00010279813), (17, 1.7765084e-05), (4, 1.5734355e-05), (24, 9.853653e-06)]
y_test: [20], top_preds: [20 17 19 24 16], top5: True
top_preds_prob: [(20, 0.999724), (17, 0.00016719518), (19, 3.6272228e-05), (24, 2.6942715e-05), (16, 8.765733e-06)]
y_test: [13], top_preds: [13  5  3  1  4], top5: True
top_preds_prob: [(13, 0.9997651), (5, 7.728341e-05), (3, 6.468926e-05), (1, 2.1106438e-05), (4, 1.63318e-05)]
y_test: [4], top_preds: [ 4  5 11  6  3], top5: True
top_preds_prob: [(4, 0.99944526), (5, 0.0002848371), (11, 8.090921e-05), (6, 7.299382e-05), (3, 4.544382e-05)]
y_test: [23], top_preds: [23  0 22 15 16], top5: True
top_preds_prob: [(23, 0.9998511), (0, 4.1304316e-05), (22, 2.9364826e-05), (15, 2.8517064e-05), (16, 1.3574967e-05)]
Top 1: 1.0, Top 5: 1.0

