_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 256)               6422784   
_________________________________________________________________
bn1 (BatchNormalization)     (None, 256)               1024      
_________________________________________________________________
fc2 (Dense)                  (None, 256)               65792     
_________________________________________________________________
bn2 (BatchNormalization)     (None, 256)               1024      
_________________________________________________________________
predictions (Dense)          (None, 26)                6682      
=================================================================
Total params: 21,312,346
Trainable params: 0
Non-trainable params: 21,312,346
_________________________________________________________________
100%|██████████████████████████████████████| 1309/1309 [00:02<00:00, 590.79it/s]
100%|██████████████████████████████████████████| 26/26 [00:00<00:00, 409.80it/s]
y_test: [10], top_preds: [10  4 11 13  5], top5: True
top_preds_prob: [(10, 0.65479904), (4, 0.3056579), (11, 0.022735644), (13, 0.010406709), (5, 0.0017604406)]
y_test: [5], top_preds: [ 5  6 11  4  9], top5: True
top_preds_prob: [(5, 0.78028053), (6, 0.1717236), (11, 0.0113430405), (4, 0.011165773), (9, 0.009110387)]
y_test: [2], top_preds: [14  0  2  7  1], top5: True
top_preds_prob: [(14, 0.25381702), (0, 0.19947506), (2, 0.15431757), (7, 0.12499386), (1, 0.072601095)]
y_test: [0], top_preds: [ 0 25 22 10 15], top5: True
top_preds_prob: [(0, 0.8824627), (25, 0.09552221), (22, 0.0046024625), (10, 0.00419491), (15, 0.0027274473)]
y_test: [3], top_preds: [ 3 10 25 22 19], top5: True
top_preds_prob: [(3, 0.9849551), (10, 0.009144937), (25, 0.0027947593), (22, 0.0012054652), (19, 0.00043842854)]
y_test: [22], top_preds: [22 16 24 15 14], top5: True
top_preds_prob: [(22, 0.9455787), (16, 0.013532187), (24, 0.013089093), (15, 0.008711041), (14, 0.0054467376)]
y_test: [1], top_preds: [ 1  7  0  5 25], top5: True
top_preds_prob: [(1, 0.9857696), (7, 0.0059517385), (0, 0.0026070494), (5, 0.0023932667), (25, 0.00094275625)]
y_test: [12], top_preds: [12 11 10  9  3], top5: True
top_preds_prob: [(12, 0.6488381), (11, 0.3494552), (10, 0.0011667979), (9, 0.00017030249), (3, 9.9707286e-05)]
y_test: [16], top_preds: [16 23 17 24  0], top5: True
top_preds_prob: [(16, 0.9937324), (23, 0.0028659638), (17, 0.001103888), (24, 0.00063060643), (0, 0.00042667383)]
y_test: [17], top_preds: [17 20 19 21 16], top5: True
top_preds_prob: [(17, 0.9998976), (20, 3.570634e-05), (19, 3.0301264e-05), (21, 2.710676e-05), (16, 3.457991e-06)]
y_test: [15], top_preds: [15 22 24 14  1], top5: True
top_preds_prob: [(15, 0.9847113), (22, 0.006121113), (24, 0.0041705957), (14, 0.0031406456), (1, 0.0005746273)]
y_test: [11], top_preds: [11  4  5 10  3], top5: True
top_preds_prob: [(11, 0.9981881), (4, 0.00074811355), (5, 0.0003826197), (10, 0.00038163885), (3, 0.00010420097)]
y_test: [8], top_preds: [ 8  4  7  9 18], top5: True
top_preds_prob: [(8, 0.9739371), (4, 0.008250773), (7, 0.004396678), (9, 0.0038581332), (18, 0.0035261551)]
y_test: [6], top_preds: [6 7 5 8 4], top5: True
top_preds_prob: [(6, 0.8155345), (7, 0.08052383), (5, 0.060882974), (8, 0.016582886), (4, 0.009657908)]
y_test: [9], top_preds: [ 9 11 21  8 19], top5: True
top_preds_prob: [(9, 0.9824471), (11, 0.0051989714), (21, 0.0026393905), (8, 0.0022146911), (19, 0.0013744906)]
y_test: [21], top_preds: [21 20  9 12  7], top5: True
top_preds_prob: [(21, 0.99495393), (20, 0.0029056398), (9, 0.00052009814), (12, 0.00031401432), (7, 0.00031114215)]
y_test: [14], top_preds: [14 15  7  2  6], top5: True
top_preds_prob: [(14, 0.9919933), (15, 0.003191862), (7, 0.001590201), (2, 0.0006835493), (6, 0.00047822783)]
y_test: [25], top_preds: [25 24 23 14 18], top5: True
top_preds_prob: [(25, 0.39682958), (24, 0.30572063), (23, 0.23403144), (14, 0.020401692), (18, 0.008904886)]
y_test: [19], top_preds: [19 17  9 20 21], top5: True
top_preds_prob: [(19, 0.6162958), (17, 0.2309438), (9, 0.030743614), (20, 0.02482301), (21, 0.023150178)]
y_test: [7], top_preds: [ 6  8 13  4 10], top5: False
top_preds_prob: [(6, 0.7633119), (8, 0.070444904), (13, 0.048840813), (4, 0.03973435), (10, 0.027316779)]
Unmatched [7] and 6
y_test: [24], top_preds: [24 23 22 25 20], top5: True
top_preds_prob: [(24, 0.8221683), (23, 0.11905374), (22, 0.023311844), (25, 0.022793498), (20, 0.0048283897)]
y_test: [18], top_preds: [18 19 17 11 23], top5: True
top_preds_prob: [(18, 0.6528067), (19, 0.16924573), (17, 0.10612494), (11, 0.013861727), (23, 0.013388544)]
y_test: [20], top_preds: [21 20  2 18 17], top5: True
top_preds_prob: [(21, 0.5044343), (20, 0.48707578), (2, 0.0015729385), (18, 0.0014770409), (17, 0.0006449705)]
y_test: [13], top_preds: [13  4  3  2  1], top5: True
top_preds_prob: [(13, 0.9480855), (4, 0.024408704), (3, 0.022971803), (2, 0.0009062734), (1, 0.000897618)]
y_test: [4], top_preds: [ 4  5 11  3  8], top5: True
top_preds_prob: [(4, 0.8934544), (5, 0.10519872), (11, 0.00090931007), (3, 0.00015151018), (8, 0.00012001685)]
y_test: [23], top_preds: [23 24 14 22 16], top5: True
top_preds_prob: [(23, 0.99945945), (24, 0.00046759582), (14, 1.8140785e-05), (22, 1.4395871e-05), (16, 1.2298936e-05)]
Top 1: 0.884615384615, Top 5: 0.961538461538

