_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
bn_flatten (BatchNormalizati (None, 25088)             100352    
_________________________________________________________________
fc1 (Dense)                  (None, 64)                1605696   
_________________________________________________________________
bn1 (BatchNormalization)     (None, 64)                256       
_________________________________________________________________
fc2 (Dense)                  (None, 64)                4160      
_________________________________________________________________
bn2 (BatchNormalization)     (None, 64)                256       
_________________________________________________________________
predictions (Dense)          (None, 26)                1690      
=================================================================
Total params: 16,427,098
Trainable params: 0
Non-trainable params: 16,427,098
_________________________________________________________________
100%|██████████████████████████████████████| 1309/1309 [00:02<00:00, 587.77it/s]
100%|██████████████████████████████████████████| 26/26 [00:00<00:00, 409.73it/s]
y_test: [10], top_preds: [10 17 12 20 18], top5: True
top_preds_prob: [(10, 0.99174374), (17, 0.0015058108), (12, 0.00144514), (20, 0.00070637406), (18, 0.00065647747)]
y_test: [5], top_preds: [ 5  6 11  2  4], top5: True
top_preds_prob: [(5, 0.9435593), (6, 0.025718136), (11, 0.00937068), (2, 0.004335751), (4, 0.0020532822)]
y_test: [2], top_preds: [ 2  0  4  1 19], top5: True
top_preds_prob: [(2, 0.9428278), (0, 0.0168165), (4, 0.008333977), (1, 0.0067873592), (19, 0.0026840381)]
y_test: [0], top_preds: [ 0 23  2  1 13], top5: True
top_preds_prob: [(0, 0.98627394), (23, 0.0055099954), (2, 0.0019491224), (1, 0.0012916892), (13, 0.0008964604)]
y_test: [3], top_preds: [ 3  4 10 16 19], top5: True
top_preds_prob: [(3, 0.9941082), (4, 0.0018758265), (10, 0.0006471959), (16, 0.0004223509), (19, 0.00037174855)]
y_test: [22], top_preds: [22 18 23 16 14], top5: True
top_preds_prob: [(22, 0.94187784), (18, 0.010582729), (23, 0.009761049), (16, 0.00906462), (14, 0.008060592)]
y_test: [1], top_preds: [ 1 23 13 14  7], top5: True
top_preds_prob: [(1, 0.98649395), (23, 0.0031348064), (13, 0.0024226124), (14, 0.0013542738), (7, 0.00094863493)]
y_test: [12], top_preds: [12 24  9 23  4], top5: True
top_preds_prob: [(12, 0.99624497), (24, 0.0010869245), (9, 0.000878319), (23, 0.00033664785), (4, 0.0002825065)]
y_test: [16], top_preds: [16 14 22 15  6], top5: True
top_preds_prob: [(16, 0.8965864), (14, 0.025689876), (22, 0.008862946), (15, 0.0062652016), (6, 0.00551123)]
y_test: [17], top_preds: [17 16  7  8 25], top5: True
top_preds_prob: [(17, 0.98937947), (16, 0.0026291858), (7, 0.0013159658), (8, 0.0011317988), (25, 0.0008910866)]
y_test: [15], top_preds: [15 22 25 16 21], top5: True
top_preds_prob: [(15, 0.9849582), (22, 0.0030059125), (25, 0.0024928555), (16, 0.0020993862), (21, 0.0009967962)]
y_test: [11], top_preds: [11  3  5  4 18], top5: True
top_preds_prob: [(11, 0.9793596), (3, 0.004074107), (5, 0.0034163308), (4, 0.0022439624), (18, 0.0018185518)]
y_test: [8], top_preds: [ 8  7 12  9  2], top5: True
top_preds_prob: [(8, 0.96548903), (7, 0.010872432), (12, 0.005107916), (9, 0.0029685597), (2, 0.0019047057)]
y_test: [6], top_preds: [ 6  5 11  7  2], top5: True
top_preds_prob: [(6, 0.97041243), (5, 0.012046712), (11, 0.004984051), (7, 0.0039035762), (2, 0.0016035138)]
y_test: [9], top_preds: [ 9 13 10 12 21], top5: True
top_preds_prob: [(9, 0.9921773), (13, 0.0012264121), (10, 0.0010555424), (12, 0.00057540805), (21, 0.00057179056)]
y_test: [21], top_preds: [21 20  9 10 17], top5: True
top_preds_prob: [(21, 0.98932743), (20, 0.001767773), (9, 0.0015875929), (10, 0.0011946028), (17, 0.00092188624)]
y_test: [14], top_preds: [14 16  5 21 20], top5: True
top_preds_prob: [(14, 0.95446306), (16, 0.008407982), (5, 0.007051941), (21, 0.004007477), (20, 0.003763782)]
y_test: [25], top_preds: [25 22 16 23  1], top5: True
top_preds_prob: [(25, 0.97087955), (22, 0.013067496), (16, 0.002997156), (23, 0.002501667), (1, 0.0019659991)]
y_test: [19], top_preds: [19 20  7 24 11], top5: True
top_preds_prob: [(19, 0.9789145), (20, 0.0023618063), (7, 0.0018645823), (24, 0.0018225986), (11, 0.001674532)]
y_test: [7], top_preds: [ 7  8  2 20 17], top5: True
top_preds_prob: [(7, 0.966743), (8, 0.010572998), (2, 0.003804768), (20, 0.0034767184), (17, 0.0026207706)]
y_test: [24], top_preds: [24  9  4 25 16], top5: True
top_preds_prob: [(24, 0.95448166), (9, 0.012191566), (4, 0.008467706), (25, 0.005734221), (16, 0.0033267327)]
y_test: [18], top_preds: [18 24 16 21  4], top5: True
top_preds_prob: [(18, 0.9824472), (24, 0.0020082684), (16, 0.0017409559), (21, 0.0016980928), (4, 0.0016862107)]
y_test: [20], top_preds: [20 19  7 25 15], top5: True
top_preds_prob: [(20, 0.9422839), (19, 0.008777516), (7, 0.006310922), (25, 0.0051319445), (15, 0.004859096)]
y_test: [13], top_preds: [13  8 14  3  4], top5: True
top_preds_prob: [(13, 0.9876588), (8, 0.0023923896), (14, 0.0022956682), (3, 0.0014895569), (4, 0.0012969244)]
y_test: [4], top_preds: [ 4 18 19 11  3], top5: True
top_preds_prob: [(4, 0.98739076), (18, 0.0024982078), (19, 0.0020839677), (11, 0.0012806135), (3, 0.0009984395)]
y_test: [23], top_preds: [23 24 10  0 25], top5: True
top_preds_prob: [(23, 0.9767015), (24, 0.005254999), (10, 0.003708067), (0, 0.0026568417), (25, 0.0019962073)]
Top 1: 1.0, Top 5: 1.0

